docu/como-educar-con-sw-libre-en-la-universidad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<title>Cómo Enseñar a Programar con Software Libre en la Universidad</title>
<!-- 2013-08-18 dom 22:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<link rel="stylesheet"
                       href="../other/mystyle.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">Cómo Enseñar a Programar con Software Libre en la Universidad</h1>
<p>
Primero es necesario aprender a utilizar un editor de textos decente
como por ejemplo GNU Emacs, empieza por los atajos de teclado, sigue
familiarizándote con la auto-ayuda (C-h ?), luego haz pequeñas
funciones leyendo "An Introduction to Programming in Emacs Lisp",
pensando si estas son útiles, o al menos divertidas para tí.
</p>

<p>
Te resultará muy útil tener un grupo de amigos con intereses e ideales
comunes con quienes programar, así puedes compartir trucos y bromas
con el código.
</p>

<p>
Empieza con cosas pequeñas de programas grandes, pero habiendo
entendido antes las primitivas del lenguaje.
</p>

<p>
Trata de evitar distracciones mientras estás concentrado programando y
ten claro tus pequeños objetivos y el objetivo final de lo que estás
programando.
</p>

<p>
En la Universidad hay muchas asignaturas de programación, debes tratar
de mirar siempre el código fuente de aplicaciones libres de lo que
estás estudiando.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Autor: David Arroyo Menéndez</p>
<p class="date">Created: 2013-08-18 dom 22:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.2.1 (<a href="http://orgmode.org">Org</a> mode 8.0.7)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
